
## Plan Result (prod)

[CI link](https://github.com/goda6565/lambda-bot/actions/runs/15225231768)


<pre><code>Plan: 0 to add, 1 to change, 0 to destroy.</code></pre>

* Update
  * module.lambda.aws_lambda_function.lambda


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.lambda.aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "lambda-bot-prod"
      ~ qualified_arn                  = "arn:aws:lambda:ap-northeast-1:061051222129:function:lambda-bot-prod:6" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:061051222129:function:lambda-bot-prod:6/invocations" -> (known after apply)
        tags                           = {
            "Name" = "lambda-bot-prod"
        }
      ~ version                        = "6" -> (known after apply)
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "SLACK_BOT_TOKEN"      = "arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-bot-token-bhbyN3"
              + "SLACK_SIGNING_SECRET" = "arn:aws:secretsmanager:ap-northeast-1:061051222129:secret:slack-signing-secret-bhbyN3"
                # (1 unchanged element hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

</details>




## :warning: Errors

* add a label prod/add-or-update: POST https://api.github.com/repos/goda6565/lambda-bot/issues/10/labels: 403 You do not have permission to create labels on this repository. [{Resource:Repository Field:label Code:unauthorized Message:}]
<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":10,"Program":"tfcmt","SHA1":"dbf53da0ef983500b77c912fd1dc127e9f43035d","Target":"prod","Vars":{},"WorkflowName":"Terraform Multi-Env CI"} -->